# DuctSizes Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizes Class
Members See Also
---
Class RbsDuctSizes being used to store the duct sizes
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class DuctSizes : IEnumerable<MEPSize>,
	IDisposable
```

Visual Basic
---
```text
Public Class DuctSizes _
	Implements IEnumerable(Of MEPSize), IDisposable
```

Visual C++
---
```text
public ref class DuctSizes : IEnumerable<MEPSize^>,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..DuctSizes
# See Also
DuctSizes Members
Autodesk.Revit.DB.Mechanical Namespace